InformationRegisters/СтавкиАкцизаПоставляемый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтавкиАкцизаПоставляемый</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДоЦелого</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодВидаПодакцизногоТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтавкиАкцизаПоставляемый/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
//
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт	
	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описатель.Идентификатор          		= ИдентификаторВСервисеКлассификаторов();
	Описатель.Наименование               	= НСтр("ru = 'Ставки акцизов'");
	Описатель.ОбновлятьАвтоматически 		= Истина;
	Описатель.ОбщиеДанные            		= Истина;
	Описатель.СохранятьФайлВКэш 	 		= Ложь;
	Описатель.ОбработкаРазделенныхДанных	= Ложь;	
	Классификаторы.Добавить(Описатель);	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
//
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан) Экспорт	
	Если Идентификатор <> ИдентификаторВСервисеКлассификаторов() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка	
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(Поток);
		ДанныеКлассификатора = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		НаборЗаписей = РегистрыСведений.СтавкиАкцизаПоставляемый.СоздатьНаборЗаписей();
		Для Каждого Элемент Из ДанныеКлассификатора.classifierData Цикл
			Если Элемент.Дата < "20250101" Тогда
				Продолжить;
			КонецЕсли;
			КодТовара = Элемент.Код;
			КодЕдИзм  = Элемент.ЕдиницаИзмерения;
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период                    = Элемент.Дата;
			НоваяЗапись.КодВидаПодакцизногоТовара = КодТовара;
			НоваяЗапись.Сумма                     = Элемент.Ставка;
			НоваяЗапись.ЕдиницаИзмерения          = КодЕдИзм;
			Если Элемент.Свойство("Округлять") Тогда	
				Если Элемент.Округлять Тогда
					НоваяЗапись.ОкруглятьДоЦелого = Элемент.Округлять;
				Иначе
					НоваяЗапись.ОкруглятьДоЦелого = "Ложь";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
		Обработан = Истина;
		
	Исключение
		
		Обработан = Ложь;
		ЗаписьЖурналаРегистрации(
		"ЗагрузкаКлассификатора",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.РегистрыСведений.СтавкиАкцизаПоставляемый,
		,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Возврат;
		
	КонецПопытки;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 
// Формирует идентификатор классификатора данных ставок акцизов в сервисе классификаторов.
//
// Возвращаемое значение:
//  Строка - идентификатор классификатора.
//
Функция ИдентификаторВСервисеКлассификаторов()
	
	Возврат "ExciseRates";
	
КонецФункции	
#КонецОбласти  

#КонецЕсли
